{"config": [{"config": {"trainable": true, "input_dim": 8, "U_regularizer": null, "return_sequences": false, "W_regularizer": null, "dropout_U": 0.25, "inner_activation": "hard_sigmoid", "name": "gru_15", "input_dtype": "float32", "activation": "tanh", "inner_init": "orthogonal", "stateful": false, "init": "glorot_uniform", "input_length": null, "batch_input_shape": [null, null, 8], "output_dim": 64, "go_backwards": false, "unroll": false, "consume_less": "cpu", "dropout_W": 0.25, "b_regularizer": null}, "class_name": "GRU"}, {"config": {"trainable": true, "W_constraint": null, "init": "glorot_uniform", "W_regularizer": null, "output_dim": 128, "name": "dense_24", "b_regularizer": null, "input_dim": null, "activity_regularizer": null, "b_constraint": null, "activation": "tanh"}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "dropout_4", "p": 0.5}, "class_name": "Dropout"}, {"config": {"trainable": true, "W_constraint": null, "init": "glorot_uniform", "W_regularizer": null, "output_dim": 40, "name": "dense_25", "b_regularizer": null, "input_dim": null, "activity_regularizer": null, "b_constraint": null, "activation": "linear"}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "activation_15", "activation": "softmax"}, "class_name": "Activation"}], "class_name": "Sequential"}
